mongo/9node/load-b.log
Loading workload...
Starting test.
2024-04-23 16:34:27:137 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://10.142.0.4:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-23 16:34:33:061 6 sec: 1000 operations; 166 current ops/sec; [CLEANUP: Count=1, Max=4151, Min=4148, Avg=4150, 90=4151, 99=4151, 99.9=4151, 99.99=4151] [INSERT: Count=1000, Max=235647, Min=2930, Avg=5079.57, 90=6251, 99=7143, 99.9=12143, 99.99=235647] 
[OVERALL], RunTime(ms), 6025
[OVERALL], Throughput(ops/sec), 165.97510373443984
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 47
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7800829875518672
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 47
[TOTAL_GC_TIME_%], Time(%), 0.7800829875518672
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4150.0
[CLEANUP], MinLatency(us), 4148
[CLEANUP], MaxLatency(us), 4151
[CLEANUP], 95thPercentileLatency(us), 4151
[CLEANUP], 99thPercentileLatency(us), 4151
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 5079.569
[INSERT], MinLatency(us), 2930
[INSERT], MaxLatency(us), 235647
[INSERT], 95thPercentileLatency(us), 6643
[INSERT], 99thPercentileLatency(us), 7143
[INSERT], Return=OK, 1000