mongo/9node/load-f.log
Loading workload...
Starting test.
2024-04-23 16:40:26:107 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://10.142.0.4:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-23 16:40:31:992 5 sec: 1000 operations; 167.08 current ops/sec; [CLEANUP: Count=1, Max=3945, Min=3944, Avg=3945, 90=3945, 99=3945, 99.9=3945, 99.99=3945] [INSERT: Count=1000, Max=246399, Min=2576, Avg=4975.13, 90=6391, 99=7927, 99.9=12639, 99.99=246399] 
[OVERALL], RunTime(ms), 5987
[OVERALL], Throughput(ops/sec), 167.02856188408217
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 62
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.0355770836813094
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 62
[TOTAL_GC_TIME_%], Time(%), 1.0355770836813094
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3945.0
[CLEANUP], MinLatency(us), 3944
[CLEANUP], MaxLatency(us), 3945
[CLEANUP], 95thPercentileLatency(us), 3945
[CLEANUP], 99thPercentileLatency(us), 3945
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 4975.131
[INSERT], MinLatency(us), 2576
[INSERT], MaxLatency(us), 246399
[INSERT], 95thPercentileLatency(us), 6719
[INSERT], 99thPercentileLatency(us), 7927
[INSERT], Return=OK, 1000